---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericTransparencyImageFade
source: html/30d2c9c6-bbde-74dc-063f-83c65ca00b5c.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericTransparencyImageFade Property

The property labeled "Image Fade" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericTransparencyImageFade { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".